while True:
    print('експозиція\nти людина в світі з назвою "ерол 312" '
          'твоя задача не вмерти і дійти до самого короля\n '
          'тому що король злий диктатор\n '
          'який позбавляється всіх незаконослухняних громадян\n '
          'і ви теж входите до цього списку удачі!')

    print('глава 1 король')
    print('1 на право')
    print('2 на ліво')

    a = input('ти ідеш по вулиці ти бачиш роздоріжжя куди підеш?')
    if a.isdigit():
        a = int(a)
        if a == 1:  # 1
            print('1 постукати')
            print('2 йти далі')
            a = int(input('ти підходеш до дому що будеш робити?'))
            if a == 2:  # 2
                print('ти постукав тобі відкрили і запросили в дім')
                print('1 так')
                print('2 ні')
                a = int(input('тебе запросили на вечерю підеш?'))
                if a == 3:  # 3
                    print('їжа отруїна')
                    print('ти помер\nпідсказка: не дуже хороша ідея довіряти\n'
                          'першим зустрічним людям')
                elif a == 2:  # 3
                    print('ти пішов спати')
                    print('кнець першої глави...')
            elif a == 2:  # 2
                print('тебе вкрали робійники')
                print('ти помер\nпідсказка: розбійники теж проти тебе')
        elif a == 2:  # 1
            print('ти бачиш патрульного ти пійшов до нього ззаду\n'
                  ' він налякався вистрілив в тебе ти програв ')
            print('ти помер\nпідсказка: всі патрульні проти тебе')
        else:
            print('шо?')
