day = input("Який сьогодні день тижня? ")

if day == "субота":
    print("Ура! Можна відпочивати!")
elif day == "неділя":
    print("Відпочиваємо, але завтра знову до роботи")
elif day == "понеділок":
    print("Робота")
else:
    print("Працюємо")

if day != "понеділок":
    print("Ну хоч не понеділок, можно жити")

password = input("введіть пароль")
if password == "6554":
    print("Доступ дозволенно")
    print("Доступ дозволенно")
    print("Доступ дозволенно")
else:
    print("Доступ забароненно")
    print("Доступ дозволенно")
    print("Доступ дозволенно")

print("dfdsdfsdf")

